# Find and drop outliers

In [31]:
import pandas as pd
import numpy as np

df = pd.read_csv('car-sales.csv')
df.head()

     Make Colour  Odometer (KM)  Doors    Price
0   Honda  White        35431.0    4.0  15323.0
1     BMW   Blue       192714.0    5.0  19943.0
2   Honda  White        84714.0    4.0  28343.0
3  Toyota  White       154365.0    4.0  13434.0
4  Nissan   Blue       181577.0    3.0  14043.0

In [32]:
# How to check how many different Makes

print(df['Make'].unique())


print()
# Count of each

print(df['Make'].value_counts())

['Honda' 'BMW' 'Toyota' 'Nissan' nan]

Toyota    379
Honda     292
Nissan    183
BMW        97
Name: Make, dtype: int64

In [33]:
# How to drop a certain row 
# dropping INDEX (not row num) 2, axis = 0 (row) (axis = 1 = column)
df.drop(labels=2, axis=0, inplace=True)
df.head()

     Make Colour  Odometer (KM)  Doors    Price
0   Honda  White        35431.0    4.0  15323.0
1     BMW   Blue       192714.0    5.0  19943.0
3  Toyota  White       154365.0    4.0  13434.0
4  Nissan   Blue       181577.0    3.0  14043.0
5   Honda    Red        42652.0    4.0  23883.0

In [34]:
# Check all rows with colour = white
mask = df['Colour'] == 'White'
df[mask].head()

      Make Colour  Odometer (KM)  Doors    Price
0    Honda  White        35431.0    4.0  15323.0
3   Toyota  White       154365.0    4.0  13434.0
7    Honda  White            NaN    4.0  20306.0
8      NaN  White       130538.0    4.0   9374.0
10  Nissan  White       167421.0    4.0  16259.0

In [40]:
# Convert datatype of a column

df['Price'] = df['Price'].astype(str) 
df.head()
type(df['Price'][0])
df['Price'] = df['Price'].astype(float)

In [ ]:
# how to drop missing values

# drop a row

# how to drop a column

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 999 entries, 0 to 999
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           950 non-null    object
 1   Colour         949 non-null    object
 2   Odometer (KM)  949 non-null    float64
 3   Doors          949 non-null    float64
 4   Price          999 non-null    object
dtypes: float64(2), object(3)
memory usage: 79.1+ KB

In [37]:
# How to keep only the rows with no missing values in 'Make'
# in other words how to drop all the missing values of 'Make'

mask = df['Make'].notna()
df[mask].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 950 entries, 0 to 999
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           950 non-null    object
 1   Colour         901 non-null    object
 2   Odometer (KM)  902 non-null    float64
 3   Doors          902 non-null    float64
 4   Price          950 non-null    object
dtypes: float64(2), object(3)
memory usage: 44.5+ KB

In [ ]:
# How to fill missing values with mean, with 0, with quantile x w/e

Feature encoding and feature scaling
One-Hot, Ordinal, Standardization, Normalization, etc

Normalization -> like minmax scaler 
Standardization -> create data set - mean / stddev

Data Viz

all the plots in Lab, eg pairplot, jointplot, barplot, countplot, hist, kdeplot (kernal density estimate), etc

**pieplot and swarmplot will certainly be asked**

In [51]:
# how to find the mean price for each Make
df.groupby('Make').mean()

# top 2 highest average price for makes
top = df.groupby('Make').mean().sort_values(by='Price', ascending=False)[:2]

In [53]:
# Find all the rows with Make in the top two makes
df1 = df[df['Make'].isin(top.index)]
df1

       Make Colour  Odometer (KM)  Doors    Price
1       BMW   Blue       192714.0    5.0  19943.0
3    Toyota  White       154365.0    4.0  13434.0
6    Toyota   Blue       163453.0    4.0   8473.0
15   Toyota   Blue       205592.0    4.0  16290.0
16   Toyota    Red        96742.0    4.0  34465.0
..      ...    ...            ...    ...      ...
989  Toyota    Red        41735.0    4.0  13928.0
990  Toyota  White       173408.0    4.0   8082.0
994     BMW   Blue       163322.0    3.0  31666.0
995  Toyota  Black        35820.0    4.0  32042.0
999  Toyota   Blue       248360.0    4.0  12732.0

[476 rows x 5 columns]

# Clustering

cluster a dataset using K-means then compute the accuracy

Use PCA to reduce dimensionality
Cluster a dataset using Hierarchical clustering (agglomerative)
plot data

In [ ]:
from sklearn.datasets import load_iris
from sklearn.decomposition import PCA
import seaborn as sns
import matplotlib.pyplot as plt

iris = load_iris()
X = iris.data

y = iris.target

df = pd.DataFrame(X, columns=iris.feature_names)
df['Label']=y
df['Species']=df['Label'].map({0: 'versiolor', 1})
## ... whatever

In [ ]:
# Compute accuracy of KMeans clustering
count = 0
for indices, row in df.iterrows():
    if row.label == 0 and row.C_label == 0 or row.Label == 1 and row.C_label == 1 or row.Label == 2 and row.C_label == 2:
        count += 1

print(count)
print(count / 150)